{
  "posts": [
    {
      "id": "9",
      "title": "Winning Big with Kendall: Learning to Play Smart, Not Hard",
      "content": "**Men's Doubles has always been a challenge for me.** Maybe it's the testosterone flying around, but I've often found myself hitting too hard, losing patience, and slipping out of any coherent game plan. Ken, my regular partner, and I drill together twice a week. Our chemistry has grown, and we've won a couple smaller tournaments, mostly by playing our best individual games. But the truth is, we've never truly shown up with a *shared* strategy.\n\n![Ken and Laurie](/blog9/KenLaurie.jpg)\n\n## Double Tourney: Leg One – Playing the Wrong Game\n\nWhen Ojochal Racket Club (ORC) and Pura Pickleball launched their joint Doubles Tourney, I was convinced we finally had a proper plan. Our main rivals from across the clubs loved a fast game and we knew our best shot was to play varied and more calculated Pickleball.\n\nBut in the first leg, held at ORC with rally scoring and tight courts, everything unraveled. We got sucked into a firefight, abandoned our plan, and played right into our opponents' strengths. We scraped into the playoffs but were completely outplayed in the semis, then blown away in the 3rd-place playoff. Finishing 4th in a large field wasn't bad, but we were gutted.\n\n## A Long Drive and a Moment of Truth\n\nDriving home, I meditated on what went wrong. The rally scoring threw us. Ken couldn't get his power serve going on the smaller courts. There never felt like enough space to return hard-hitting serves. Worst of all, I defaulted to banging, which forced Ken to do the same. We never adjusted or implemented real changes - and it cost us.\n\n## Getting to Work – Adjustments and Accountability\n\nLeading into Leg Two, we changed everything. We talked strategy constantly. We had joint sessions with our coach Manu. Ken worked hard on his backhand dink game and on holding the kitchen line, he was becoming machine at picking the right balls out of the air and punishing them. I focused on slowing the pace, especially in Rec games, where the temptation to smash is strong.\n\nWe were ready for redemption.\n\n## Home Court Advantage at Pura Pickleball\n\nLeg Two was on our home turf in Jaco, with regular scoring and the wide-open courts of Pura. We started every game a bit nervy, giving up early leads of 4, 6, even 8 points, but we settled each time and clawed our way back to win.\n\nAround game 5 or 6, we faced an opponent Ken had historically had trouble doing well against, we couldn't get anything going and lost 3–11. But we stayed composed - better to have a hiccup now than in the playoffs.\n\n## Redemption Against the ORC Giants\n\nThe true test came against our rivals from ORC - the winners of Leg One. We'd been flat against them before, but this time we were sharp. Up 10–6, it looked like our moment … until they found another gear and blitzed consecutive winners from nowhere to pip us 10–12. Their home fans found full voice almost willing them over the line. Disappointing loss, but we *knew* now we could beat them … move on.\n\n## A Nervy Wait and a Glorious Semi-Final\n\nWe finished the round robin in a 3-way tie for 4th - scraping through on a 2-point differential. Our semi-final? Against ORC again.\n\nAnd this time, we nailed it. No magic shots or flashy plays, just discipline and sticking to the plan. When errors crept in, we didn't panic. We stayed with our strategy and closed out a composed 15–9 win. The best part was hearing the Jaco crowd get loud. My student Liam rushed the court to be the first to celebrate with me, he *knew* how big that win was.\n\n![The Winning Moment](/blog9/WinningMoment.jpg)\n\n## A Final to Remember\n\nBy now, we felt like I'd already won, we had loss three times consecutively to an amazing team and finally proved to ourselves we were good enough to get one over them. For the final, we drew up a fresh game plan to counter our next opponents, including Ken's long-time bogey player. We flew out the gates 9–1 and, although they clawed back a bit, we were too far ahead and too in-sync. Final score: 15–9.\n\nKen jumped me with a bear hug - we had done it. We could play smart and Win big.\n\n## Validation and Victory\n\nThis win took us from 4th in the Double Tourney to 2nd Overall, with some handy prize money to boot. Big ups to Claudio and Pato for winning the series and pushing us to level up.\n\nI'm proud of how I played, but even more proud of Ken. The weaknesses teams exploited in Leg One? He worked so hard on them, and this time around, those same tactics failed against him. That's what hard work delivers.\n\n## Lessons That Stick\n\n**Smart beats strong**: It's not about who hits hardest, but who executes better\n\n**Adjust the pace**: Know when to slow the game and when to speed it up\n\n**Stick to your plan**: Even when it's not working right away - trust it\n\n**Communicate and adapt**: Don't let the match drift without input\n\nWe didn't just win a Gold Medal - we won belief in ourselves, in each other, and in the idea that *smart* Pickleball is winning Pickleball.",
      "publishDate": "2025-06-15T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "winning-big-with-kendall-learning-to-play-smart-not-hard",
      "featuredImage": "/blog9/WinningMoment.jpg",
      "categories": ["Pickleball", "Costa Rica", "Tournaments", "Personal Journey"],
      "tags": ["pickleball journey", "tournaments", "strategy", "men's doubles", "coaching"]
    },
    {
      "id": "8",
      "title": "The Rise and Rise of Pi Kipness",
      "content": "If you've been following my journey in Pickleball, you'll already be familiar with Pi Kipness. She's popped up in a few of my blogs before - first as a fierce rival, then as a winning partner, and now… as a player who just knocked me out of a tournament!\n\nOver the past year, I've had a front-row seat to Pi's rise, and I can say with total confidence: we are witnessing the evolution of a star in the making.\n\n## From Opponent to Teammates\n\nWhen I first met Pi, she was already one of the most competitive young players in the region. We clashed a few times on the court - always hard-fought matches, always in good spirit - and I couldn't help but respect the fire she brought to every rally.\n\nThen came our first tournament together. We paired up, found our rhythm, and pulled off a memorable win. That experience cemented my admiration for her game, but more importantly, her growth mindset. Pi listens. Learns. Adjusts. Then comes back stronger.\n\n![Laurie and Pi at an old tournament](/blog8/LauriePiOldTourney.jpg)\n\n## Junior PPA: A New Stage, Same Hunger\n\nRecently, Pi took a huge step by competing in the Junior PPA \"Next Generation\" Tournament in the United States - facing off against some of the most promising young players in North America. She placed **4th in Singles, Girls Doubles, and Mixed Doubles** - an incredible result for someone just beginning to test herself on the international stage.\n\n## The Quarterfinal Clash\n\nThis past weekend, Pi and her talented young partner Sky faced off against Shauna and me in a high-energy quarterfinal match. And, well - they beat us fair and square. Clean, confident, and composed. I'd like to say it was a fluke… but it wasn't. Pi's game has matured to the point where she's not just playing - she's *leading* on the court.\n\nAnd I couldn't be more proud to be part of her journey - even if that means being on the receiving end of a tough loss now and then!\n\n![Pi and Sky as winners](/blog8/PiAndSkyWinners.jpg)\n\nI asked Pi a few questions about the experience and her evolving mindset:\n\n---\n\n## Q&A with Pi Kipness\n\n**What was it like stepping into the Junior PPA tournament for the first time?**  \nWas it nerve-wracking, exciting, or just business as usual?\n\nIt was exciting and chaotic, especially when I saw the PPA Pros. It was so unreal cause they're my idols. I mean, it's the PPA, so it's my dream tournament and it's just so deep in the aspect of that there are so many pros there and watching you and just playing on the same court as them or just watching them. It was just crazy.\n\nIt's more like a foreign atmosphere, because in the tournaments here in Costa Rica it's kind of friendly, it's not very friendly there, its' not hostile, it's just way more competitive.\n\nI was so nervous I called Coach Manu and you to help calm me down, but it didn't really work.\n\n**You placed in the top 4 in *all three categories*. What part of your game do you think shone the most during the tournament?**\n\nMy mental game, because I don't think I broke down and I didn't give up even when the score was really bad, no matter what the score was, or how I played the last point, I really always tried my best.\n\n**Were there any standout matches or moments that you'll never forget?**\n\nMeeting Anna Waters, Anna Bright, Gabe Tardio, Georgia Johnson, a bunch of the Pros, I'll never forget that. Anna Leigh gave me her hat so that was so cool.\n\n**What has been the biggest challenge in leveling up your game this past year - mentally, physically, or emotionally?**\n\nBeing a mentally strong player and not getting too emotional about the points because before I would care about every single point, and now I feel like I'm more stable in that aspect. Obviously, like, technique-wise, I have a lot to work on, but I think I improved a lot mentally.\n\n**What are your biggest Pickleball goals over the next 12 months? Any tournaments you're especially targeting?**\n\nObviously I want to compete in more PPA tournaments and I want to do well, especially in singles and Girls doubles, because I just love playing those categories. I'm going to Florida in a few days for a really intense Summer Camp, its 6-8 hours of Pickleball a day for two weeks straight. I'm not looking forward to that, but I know it'll definitely improve my game, for sure because, like, then I'll be able to play for 10 hours straight without getting super tired.\n\n**We've faced off and played as partners - what have you learned from those experiences, if anything? How did it feel getting such an important win this past weekend?**\n\nWhat have I learned from you? I guess I used to give up, if the score was really bad, now I don't because you never give up, you might get annoyed but you never give up, even if you down 10-0 you would still try your best.\n\nGetting the win over you and Shauna, obviously It felt good because you guys are a good team and we beat you, it was my first tournament with Sky. It was good to get a win over a good team for sure.\n\n---\n\n![Keep an eye on Pi](/blog8/KeepanEyeonPi.jpg)\n\n## Keep an Eye on This One\n\nPi Kipness is a name you're going to hear more of — not just in Costa Rica, but further afield too. She's got the drive, the talent, the humility, and the support around her to go far.\n\nRising star? No doubt. And trust me - she's only getting started. Big respect to her dad Yoav and top coach Manu Bellizia, who's brilliantly shaping Pi into the player we're all going to be hearing a lot more about.",
      "publishDate": "2025-06-06T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "the-rise-and-rise-of-pi-kipness",
      "featuredImage": "/blog8/PiAndSkyWinners.jpg",
      "categories": ["Pickleball", "Costa Rica", "Personal Journey", "Youth Players"],
      "tags": ["pickleball journey", "junior players", "pi kipness", "tournaments", "coaching"]
    },
    {
      "id": "7",
      "title": "Support, Reset, Repeat - My New Rules for Doubles Play",
      "content": "These past few weeks I've been settling into an entirely new life. I moved towns and went from being a single guy playing Pickleball for hours every day to being a partner to a single Mom who not only has a pre-teen son, but also 5 dogs and 3 cats - in addition to my own dog and cat. It's fair to say Pickleball took a bit of a backseat.\n\n## New Rhythms and Shared Responsibilities\n\nThe flip side has been a much more manageable coaching schedule and the flow of sharing a home most days with my partner, her son, and all the animals. I'm contributing to the mountain of daily chores, cooking dinner, and figuring out the beautiful chaos of blending a family.\n\n## Tournament Time After Time Off\n\n![Team at tournament](/blog7/TeamImageNormal.jpg)\n\nWhile this transition has been amazing, my match fitness took a knock. Heading into a tournament with a slightly less competitive field, I thought we stood a fair chance — but I knew it would still be a challenge.\n\nThat said, somewhere between managing expectations after a three-week break from competition, I got super fired up and forgot it all. I did what I always do: I went for gold and somehow expected to win it. That was my first mistake.\n\n## Pressure Creeps In\n\nI've always performed better without the self-imposed expectation to win and have worked hard at letting that go. But with what looked like an easier draw, I slipped into old habits — and that led to mistake number two.\n\n## When the Wheels Came Off\n\nAfter winning our first four Round Robin games, we came up against two tougher teams. In the first of those, we kind of fell apart. We were down 0-9. I focused too much on Shauna, trying to will her out of what I felt was a negative mindset i.e. her being too hard on herself after some repeated errors.\n\nAt the same time, I started pushing too hard to cover for the slump, which only led to more mistakes. Then - and I wasn't even aware I did this - after one of her shots hit the net, I let out an audible \"Ugghhh\". I stopped giving high fives and paddle touches. I broke our connection.\n\n## Owning My Part\n\nI only found this out later that evening when I asked Shauna what we could do differently next time. Hearing how I'd acted, I felt gutted. I've always been against players who get down on their partners. I coach people to reset and stay supportive - yet in that moment, I'd done the opposite.\n\nI was being tough on her for not moving on from a mistake, but the truth was, I'd made it harder for her. I let frustration leak through. I made her feel less confident, and less able to bounce back.\n\n![Shauna and Laurie](/blog7/ShaunaLaurie3.jpg)\n\n## Back to Positivity\n\nI owned it. I promised to be better, to never again show frustration, and to always support my partner - up or down. I was really disappointed in myself and spent some time beating myself up before shifting back to the positives.\n\nShauna, to her credit, never got down on me. She focussed on the Pickleball and brought all this up constructively later that night.\n\n## A Late Comeback and a Tough Loss\n\nShe shook off the slump and helped us mount a killer comeback — from 0-6 down to an 11-6 win in our final Round Robin game.\n\nIn the semi-final, we were down 0-13, but we rallied hard and played our best Pickleball of the day. We tied it up 13-13 before a freakish walk-off ATP winner by our opponent sealed it. Just like that, our tournament run ended.\n\n## What I Learned\n\nI walked away with some clear lessons:\n\n**Never expect to show up and win — you've got to earn it.**\n\n**Winning isn't just on the scoreboard — it's in how you behave, how you compete, and how you treat both your opponents and your partner.**\n\n**Support your partner, no matter the score.**\n\nWe also figured out exactly what to improve before a bigger tournament the following week - and we set a solid plan to train and get back to top form.",
      "publishDate": "2025-05-29T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "support-reset-repeat-my-new-rules-for-doubles-play",
      "featuredImage": "/blog7/TeamImageNormal.jpg",
      "categories": ["Pickleball", "Personal Journey", "Relationships", "Tournaments"],
      "tags": ["pickleball journey", "relationships", "partnerships", "mental game", "tournament lessons"]
    },
    {
      "id": "6",
      "title": "From Agassi to Me: How a Legend threw Gas on my Pickleball Fire",
      "content": "When I saw Andre Agassi, my childhood tennis hero, step onto the court at age 55 to compete in a PPA Pickleball tournament alongside Anna Leigh Waters, I couldn't help but feel a surge of something deep. Not just nostalgia. Not just admiration. Inspiration.\n\n## A Comeback that Hit Me Right in the Feels\n\nLet me rewind. Back in my tennis days, I wasn't just a casual Agassi fan, I was Agassi-obsessed. The flair, the fire, the headbands, the rebel energy. He didn't just play tennis, he lived it on his own terms. And for a kid like me, that mattered.\n\n![Andre Agassi](/blog6/Agassi1.jpg)\n\n## Pickleball: The New Obsession\n\nFast forward a couple of decades and here I am, 46 years old, diving headfirst into Pickleball, the sport I never saw coming, but which now shapes my days, my work, and my purpose. I'm training, coaching, competing, improving. Only ten months ago, I picked up a Paddle for the first time, now, I'm all-in. Coaching. Training. Running events. Playing tournaments. Even launching a business around it. It's funny, Pickleball started as a casual curiosity, and now it's a central force in my life.\n\n## The Agassi Paddle that Closed the Loop\n\nRecently I switched to the Agassi JOOLA paddle, designed for players like me: ex-tennis, two-handed backhand, power-focused. It immediately clicked. Using the Agassi paddle feels like coming full circle. It's not just a piece of gear, it's a symbol.\n\nA reminder of where I started and how far I've come. It connects my past in tennis to my present in Pickleball in a really powerful way.\n\n![JOOLA Agassi Paddle](/blog6/JOOLA_AgassiPaddle.jpg)\n\n## Why Watching Agassi Compete Meant So Much\n\nSeeing Agassi step onto a Pickleball court, even decades past his prime, was nothing short of inspiring. He wasn't trying to prove anything. He was simply there to *play*. To compete. To connect with the game and the crowd and maybe even with a new generation.\n\nIt reminded me that age is just a number, and passion doesn't have an expiry date.\n\nHe might not have been the fastest on the court. He might not have dominated. But his timing, his touch, and his sheer willingness to show up, it was everything.\n\n## The Real Lesson: Keep Showing Up\n\n![Laurie Competing](/blog6/LaurieCompeting.jpg)\n\nAgassi's comeback wasn't about glory. It wasn't about medals. It was about presence. It was about proving, to himself and maybe the rest of us, that joy, competition, and passion don't need to fade.\n\nThat's the energy I'm carrying into this next chapter of my Pickleball journey. Not to be the best in the world, but to give my best to the game I love.\n\nSo here's to the comeback stories. The full-circle moments. The courage to compete, no matter your age, history, or journey.",
      "publishDate": "2025-05-15T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "from-agassi-to-me-how-a-legend-threw-gas-on-my-pickleball-fire",
      "featuredImage": "/blog6/Agassi1.jpg",
      "categories": ["Pickleball", "Personal Journey", "Inspiration"],
      "tags": ["pickleball journey", "inspiration", "andre agassi", "equipment", "passion"]
    },
    {
      "id": "5",
      "title": "Love and Pickleball: A Winning Combination",
      "content": "Pickleball has a unique way of bringing people together, whether it's through fierce competition or the simple joy of playing a sport. But sometimes, it brings people together in unexpected ways, this is the story of how one tournament led to a partnership that turned into something much more.\n\n## The Beginning: A New Coach and a New Partner\n\nShauna was my second-ever Ojochal student when I became a Pickleball coach. From the moment I met her, I could tell she was something special. Her enthusiasm was infectious, and her energy was unmatched. But what really stood out was her competitive streak, something I completely related to. Even the simplest drills saw her giving 110%, and that made her stand out. It was impossible not to like her.\n\nLater, when I reviewed the footage of our lessons, I caught Shauna making faces at my camera in the background. I couldn't help but laugh - she was as goofy as she was driven, and I found myself enjoying every minute.\n\n![Shauna and Laurie](/blog5/ShaunaLaurie1.jpeg)\n\n## A Special Tournament Invite\n\nWhen Roger, the owner of Jungle Pickleball, invited me to play in a Memorial Tournament with 12 other teams, I needed to pick a local partner. Shauna was the first person who came to mind. By this point, we had been texting regularly, and the excitement to team up was palpable. \n\n## A Tournament Full of Vibes\n\nThe tournament itself was an absolute vibe. So many teams, so much energy, and a spirit of camaraderie that was contagious. Sure, there were a few lower DUPR teams, but that didn't take away from the fun. Shauna and I hit the ground running, and when we faced our first real challenge, we were both locked in and ready to fight.\n\nWe found ourselves facing Bel (my opponent from the gripping semi-final win in my first tournament at Jungle Pickleball) and her partner, Claud, a fellow Southern African from Zimbabwe. Claud, despite being a senior player, had the power of a tennis player. He hit the ball like a cannon and had a tricky lob along with a solid kitchen game. Bel, as always, was relentless, chasing everything down and refusing to give an inch. The match was tough, but we managed to pull through with a win, it was close, though.\n\n## Unbeaten and Calm Under Pressure\n\nAs the Round Robin phase continued, Shauna and I remained unbeaten, and what struck me the most was how effortless everything felt. We were calm, encouraging, and never let the pressure get to us. It was one of those rare moments where everything just clicks. We were a team, and it felt like we'd been playing together for years.\n\nAs #1 seeds, we had an easier path to the semi-finals, and even though we had a slow start, we found our rhythm and secured our spot in the final.\n\n## The Final: A Nerve-Wracking Finish\n\nAfter a long wait and a tense second semi-final, it was finally time for the final. Shauna and I came out strong, taking an 8-4 lead in a game to 15. But just when we thought we had the game in the bag, a few unforced errors crept in. Bel and Claud, now with a surge of energy, clawed their way back to 11-13. \n\nThe nerves were high, but I remained calm. I walked over to Shauna and reminded her of how incredible she had played all day. I told her how great of a team we made, and I could sense her relax. That was all it took - two quick points later and we were champions.\n\nFull credit to Bel and Claud, they made us work for every point and never gave up. It was a match that could've easily gone the other way.\n\n![Shauna and Laurie with medals](/blog5/ShaunaLaurie2.jpeg)\n\n## More Than a Victory: A New Chapter\n\nAs the tournament ended and we celebrated our victory, something unexpected happened - Shauna and I found that the ease we felt on the court translated off it as well. What started as a competitive partnership soon blossomed into something more. The way we supported each other during tough moments, the way we communicated and worked as a team, it all created a bond that was undeniable.\n\nThe connection between Shauna and I was no longer just about Pickleball - it was about something deeper, something that had started to blossom in the background of our matches. The tournament didn't just bring us a trophy; it brought us closer together in ways we hadn't expected.\n\n## From Partners on the Court to Partners in Life\n\nSometimes, Pickleball isn't just about the game. It's about the people you meet, the friendships you form, and the unexpected connections that happen along the way. For Shauna and me, this tournament marked the beginning of something special. What started as a competitive partnership soon turned into something more - something that felt right both on and off the court.\n\nAnd that, for me, is the real victory.",
      "publishDate": "2025-04-28T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "love-and-pickleball-a-winning-combination",
      "featuredImage": "/blog5/ShaunaLaurie2.jpeg",
      "categories": ["Pickleball", "Costa Rica", "Tournaments", "Personal Journey", "Relationships"],
      "tags": ["pickleball journey", "tournaments", "championship", "partnership", "relationships"]
    },
    {
      "id": "4",
      "title": "Winning with Pi: From Rivals to Champions",
      "content": "The very first time I played in Open Play, back when Pura Pickleball was still under construction and the owner, Rick, let us all play for free, I remember being amazed by the ferocious talent of young Pi. A tiny 11-year-old dynamite package, she hit the ball like a cannon and was not out of place playing with adults.\n\n## A Growing Rivalry\n\nOnce tournaments started, my first mixed partner, Tara, and I regularly faced off against Pi and her father, Yoav. The intensity of these matches increased with every tournament. In one, we beat them in a close game during the Round Robin before meeting them again in the final, where we managed to overcome them for Tara and my first tournament win.\n\n![All four of us after a tournament](/blog4/AllfourofUs3.jpg)\n\nIn the next tournament at the Muni, Pi rose to the occasion and buried Tara and me in the Round Robin. Somehow, we made it through the playoffs while they didn't. As documented in the Ojochal Tourney Blog, Pi and my coach, Manu, dominated us in the Round Robin of that tournament. They later met us in a dream final, where they held a strong lead before Meli and I mounted an insane comeback to clinch the championship.\n\n## Pi's Determination to Win\n\nWith every shortcoming, Pi's resolve to win a big tournament only grew stronger. She continued training with Coach Manu, competing more, and building her mental game to better handle big moments.\n\nIt was with this context that Pi and I finally agreed to join forces and play a tournament at our home club, Pura Pickleball in Jaco.\n\n## A Rocky Start\n\nWe started against a team that had never played together—JP, \"The Banger,\" who was fast improving his slow game, and his partner, Cata, who was still relatively new to the sport. Perhaps underestimating them, and still figuring out our own team chemistry, Pi and I suffered a shock loss.\n\nWe knew that because of the tournament format, everyone had a chance in the playoffs. Our next match was against the tournament favourites, a last-minute scratch team featuring Sherri and Corey. This time, we woke up—taking an early lead, letting it slip, regaining momentum—only to lose in a heartbreaking 14-16 battle. We knew we had work to do to turn the day around.\n\n## Gaining Momentum\n\nWhat followed was two dominant wins where we dropped only two points. In the first round of Single Elimination, we met JP and Cata again. This time, we had rhythm and momentum, securing a victory that set up a final rematch with Sherri and Corey.\n\n![Pi and Laurie with medals](/blog4/PiandLaurieMedals3.jpg)\n\n## A Championship Comeback\n\nWe started the final terribly, quickly falling behind 0-6 in the one-game final to 15. Yet, I recall feeling so calm, and Pi's energy mirrored mine—it felt like just a matter of time.\n\nThen, just like that, a switch flipped. We found our game, clawed back, and suddenly, we were changing sides with an 8-6 lead, moving to our favoured side. Before we knew it, we had match point, and fittingly, Pi sealed the win at 15-7. We were the champions!\n\n## A Special Victory\n\nPi more than held her own—at times, it felt like she carried me. We did an amazing job lifting each other up after mistakes, making each other laugh when we felt down, and most of all, we had the added bonus of our Coach Manu cheering us on. His presence was invaluable in key moments, and we both wanted so badly to make him proud.\n\n![Pi, Manu, and Laurie](/blog4/PiManuLaurie3.jpg)\n\nThis victory was especially sweet because it represented a full circle moment in my pickleball journey. From facing Pi as a fierce opponent to winning as partners, our combined journey showcases what makes pickleball so special - the community, growth, and pure joy of the game.",
      "publishDate": "2025-04-18T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "winning-with-pi-from-rivals-to-champions",
      "featuredImage": "/blog4/PiandLaurieMedals3.jpg",
      "categories": ["Pickleball", "Costa Rica", "Tournaments", "Personal Journey"],
      "tags": ["pickleball journey", "tournaments", "championship", "coaching", "partners"]
    },
    {
      "id": "3",
      "title": "From Player to Coach: My Accelerated Journey into Pickleball Coaching",
      "content": "I was deep into my Pickleball journey - competing, training, and just starting my Pickleball Coaching Certification - when an unexpected opportunity presented itself.\n\nDuring a conversation with a friend from Jungle Pickleball in Ojochal, she casually mentioned that the club was looking for a coach. That got my attention.\n\nI reached out to the club owner, and after multiple rounds of discussions, we decided to give it a try. My credibility in Ojochal was already sky-high after my recent tournament win, so the timing couldn't have been better.\n\n## Preparing for My First Coaching Sessions\n\nI was determined to hit the ground running. First, I pushed myself to the limit, fast-tracking my Pickleball Coaching Certification to ensure I was fully qualified for my first official lessons. It meant long nights studying, relentless practice sessions, and cramming in every bit of coaching knowledge I could absorb - I would not show up unprepared.\n\n![PCI Certification](/blog3/CertificatePCI.jpg)\n\nI also knew I needed real coaching experience before stepping onto the court with paying students. So, I offered free lessons to my friends and their kids. Their feedback was incredibly helpful, and those early sessions built my confidence for what was coming next.\n\n## A Fully Booked Schedule - Before I Even Started\n\nWhen my first official coaching weekend arrived, I had a packed two-day schedule—six lessons per day!\n\nTo make sure I delivered real value, I set up a camera and mic'd myself up during my sessions. This allowed me to send video feedback to my students, something that had been game-changing in my own Pickleball development. Reviewing what my coach told me - and seeing how I reacted, especially when things got technical, really helped me improve. I wanted to offer the same experience to my students.\n\n![Coaching Session](/blog3/LaurieCoachingHero1.jpg)\n\n## The Response? Overwhelming!\n\nThe sessions went incredibly well, and the feedback was amazing. The biggest sign of success? When the next two-day coaching block was announced, all the slots were filled within hours.\n\nIt was official - I had become a Pickleball Coach.\n\n## Lessons Learned from My First Coaching Experience\n\nTeaching is Different from Playing – Just because you can play doesn't mean you can coach. I had to break down skills in ways that made sense to beginners.\n\nPreparation is Everything – Having a plan for each session made the lessons flow smoothly.\n\nVideo is a Powerful Tool – My students loved having video feedback, and it helped them absorb what we worked on.\n\nConfidence Comes with Experience – I was nervous at first, but each session made me more comfortable.\n\n## What's Next? Growing as a Coach\n\nMy coaching journey has only just begun, but the response so far has been incredible. Now, I'm focused on:\n\n✓ Refining my coaching techniques\n\n✓ Expanding my client base\n\n✓ Helping more players level up their game\n\nLooking back, it's crazy to think that a casual conversation led me here. But that's how Pickleball works - it pulls you in, surprises you, and opens doors you never expected.",
      "publishDate": "2025-03-30T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "from-player-to-coach-pickleball-journey",
      "featuredImage": "/blog3/LaurieCoachingHero1.jpg",
      "categories": ["Pickleball", "Coaching", "Personal Journey"],
      "tags": ["coaching", "pickleball journey", "certification", "teaching"]
    },
    {
      "id": "2",
      "title": "From Underdog to Champion: My First Cash Prize Tournament in Ojochal (Part 2 of My Pickleball Journey)",
      "content": "After my tough reality check in Heredia, I was eager for redemption. This time, I travelled to Ojochal for a 14-team Mixed Doubles tournament - my first with prize money on the line. With my usual partner Tara unavailable, I teamed up with Meli, a naturally gifted athlete whose calm and positive energy matched mine on the court.\n\nWe had never played together before, but I knew we had good chemistry from the first few rallies. The question was - could we perform under pressure?\n\n## Day 1: Battling Through the Pool Stage\n\nThere were no easy games. We held our own, winning all the matches we should have - except for one heartbreaker. We faced a high-DUPR team, dominated early, and built a 13-4 lead… only to let it slip, eventually losing 17-15 in a thriller.\n\nThat loss stung, but we regrouped. Our only other defeat came against my coach Manu and my Pickleball bestie, Pi—two players I deeply respect. Still, we finished the day in the top four, keeping our playoff hopes alive. The challenge? We needed to win two out of three matches on Day 2 to qualify for the knockout rounds.\n\n![Day 1 tournament play](/blog2pic1.jpeg)\n\n## Day 2: Playoff Push & A Shift in Mindset\n\nThe next morning, we took a tough loss in our first match. Suddenly, the pressure was on. But we fought back, grinding out the two wins we needed to squeak into the semi-finals - my real goal for the weekend.\n\nAt this point, something shifted. Unlike my past tournaments where nerves kicked in, I felt free. The pressure was off - I had already exceeded my expectations. And as soon as I let go of the result and just focused on playing my game, everything clicked.\n\n![Day 2 tournament play](/blog2/blog2pic2.jpg)\n\n## Semi-Finals: The Rematch & a Breakthrough Win\n\nOur semi-final matchup was a copy-paste of the round-robin loss. Once again, we jumped out to a big lead, only to let it slip as our opponents clawed back.\n\nBut this time, we held our nerve. At 14-14, we pulled off two incredible rallies - both of which easily could have gone either way. 16-14. We had done it! We were in the finals, guaranteed prize money, and I was beyond thrilled.\n\nAs if scripted, the other semi-final saw Manu and Pi claim victory, setting up a dream all-Jaco final in Ojochal.\n\n![Semi-finals match](/blog2/blog2pic3.jpg)\n\n## The Championship Match: A Mental Battle\n\nManu and Pi started strong, picking up a handy lead. Once they hit double digits, something clicked for Meli and me.\n\nWe found the kitchen faster.\nWe neutralized Manu's aggressive play.\nWe stayed patient.\n\nOne of the biggest moments came when Manu and I got into a brutal dink battle. Manu barely kept a net tape shot alive, I hit the best dink of my life and when Manu attempted an ATP, it sailed long - suddenly, we had championship point.\n\nI stepped up to serve and ripped a beauty. Pi did well to get a paddle on it, but the return clipped the net and fell short. Game over. We were champions.\n\n## Lessons from Ojochal\n\nThis tournament was more than just a win - it was a huge mental breakthrough for me.\n\n### Playing Loose vs. Playing Tense\n- The moment I stopped obsessing over results, my game flowed better.\n- No expectations = better decision-making and execution.\n\n### Winning with a New Partner\n- Chemistry matters, but strategic adjustments matter more.\n- Meli and I played smart, stuck to our strengths, and kept believing.\n\n### Beating My Coach! (Well, Kind Of...)\n- Manu is still a far superior player, but I saw firsthand how strategy and execution can level the playing field.\n\nThis tournament was proof that I was evolving—not just as a player, but in my mindset and approach to competition.",
      "publishDate": "2025-03-15T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "from-underdog-to-champion-pickleball-journey-part-2",
      "featuredImage": "/blog2_header.jpeg",
      "categories": ["Pickleball", "Costa Rica", "Personal Journey", "Tournaments"],
      "tags": ["pickleball journey", "tournaments", "coaching", "championship"]
    },
    {
      "id": "1",
      "title": "From Hospitality to Digital Nomad to Pickleball Addict in Costa Rica: My Journey to Pura Vida Part 1",
      "content": "For over 20 years, I worked in the hospitality industry, wearing every hat: waiter, chef, restaurant manager, hotel manager. I loved it… until I didn't. COVID made it painfully clear how little hotel owners and corporate leadership valued us, and that pushed me toward something new.\n\nFeeling unappreciated post-pandemic, I took a bold leap—cutting my salary in half and giving up all benefits—to go fully remote. I quickly made up the difference in salary with new opportunities and spent a year in the Canary Islands, Spain, and Sardinia, Italy, where I learned to play Padel. Digital Marketing has given me so much freedom. It's still my full-time hustle and I love it. It's also what brought me to Costa Rica—chasing adventure, sunshine, and a fresh start.\n\n![Digital nomad lifestyle in Costa Rica](/blog1/img1.jpg)\n\n## Discovering Pickleball in Costa Rica\n\nA few months into my time in Costa Rica, I met some people opening a Pickleball club. They needed help with digital marketing and social media, so I jumped in. One day, during a promotional shoot, I ended up as a model, paddle in hand, for my very first game of Pickleball. As a former tennis player, I picked it up fast. After a few rec games, I knew I was hooked—though mastering the kitchen game was a different story.\n\n## My First Tournament Experience\n\nI was already hooked on Pickleball—but my first tournament changed everything. None of the top players asked me to partner with them, which stung. But then I got lucky. I teamed up with Tara for Mixed Doubles—she was also new to the game but full of fight. We started off nervously, losing our first game to a couple we would have smoked in a rec game.\n\n## The Turning Point\n\nSomehow, we pulled it together—going on an unbeaten run through five matches, including a tough quarterfinal and semifinal. We didn't win with superior technical skills but with sheer grit and determination. Reaching the final felt incredible, especially considering how new we both were to the sport. We fought hard but ultimately fell to a stronger team.\n\n![Tournament play with partner](/blog1/Img2.jpg)\n\n## First Gold and Harsh Lessons in Heredia\n\nThe next tournament was a smaller local one. My Men's Doubles partner and I won, while Tara and I took it a step further to claim gold—my first double gold. At the next tournament, we entered a much tougher city competition in Heredia, near San José, and got crushed. The level of play was way higher, and my weaknesses got exposed fast. This would turn out to be the most defining weekend in my Pickleball career. I came home bummed out but fiercely determined to improve… I kept asking myself over and over, how do I get as good as those guys?\n\n![Tournament reflection](/blog1/blog-1-img3.jpeg)\n\n## The Obsession to Improve\n\nThis started a journey of getting 1-on-1 lessons with my Coach Manu and setting up drilling sessions multiple times a week. I started reading up on all the materials I could find about improving my game and began recording all my sessions for video feedback. Pickleball became my life, and there was space for little else outside of working hours.\n\n## A Wake-Up Call\n\nThat weekend in Heredia was a wake-up call. I wasn't just playing for fun anymore—I wanted to get better. What happened next? A showdown with my mentor in a tournament final, catching the coaching bug, and diving even deeper into the Pickleball obsession. More on that in Part 2.",
      "publishDate": "2025-03-01T10:00:00Z",
      "status": "published",
      "author": "Laurie Meiring",
      "slug": "from-hospitality-to-pickleball-addict-part-1",
      "featuredImage": "/blog1-img4.jpeg",
      "categories": ["Pickleball", "Costa Rica", "Personal Journey"],
      "tags": ["digital nomad", "pickleball journey", "tournaments", "coaching"]
    }
  ]
} 